Revit 2026 API

# ApplicationLanguage Property

---

The language used in the current session of Revit.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public LanguageType Language { get; }
```
```vb
Public ReadOnly Property Language As LanguageType
	Get
```
```cpp
public:
property LanguageType Language {
	LanguageType get ();
}
```
```fsharp
member Language : LanguageType with get
```

#### Property Value

LanguageType

Use this property to determine the language used by Revit; this can allow your application to load the appropriate resources.

#### Reference

Application Class

Autodesk.Revit.ApplicationServices Namespace